Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1956cb75-56b8-44d3-8976-c6da63c7e472">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e6ff1a5-fcd3-468d-afb2-4548864e1036">
    <name>ДатаАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e3a25bb8-46cc-47c7-88ab-d8638955a412">
    <name>ППРИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42802afd-70ab-4cd7-9b79-5e87db6590e0">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="007823c2-bb3a-4d9b-87d1-b5d3444f3df5">
    <name>ЗакрываемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="76a060af-30f2-4d31-a1e0-f17789c677b6">
      <name>Перенесен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ad8bf9c9-0087-44cc-849d-67c3762f7c6f">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="350c3b6f-c76f-4d49-957e-0ce792d0ed05">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af553d9d-972c-4298-b6a4-887e960089ef">
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32713c10-0fa0-41cc-850c-655be40da2d9">
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="189e7549-3f0c-418a-b4e1-57ef1a2dcf23">
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0160c88d-a1cc-4915-9cef-f895a1ca119d">
      <name>Отменен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="049f70c2-3f4f-41b2-a503-10a28b152fa7">
      <name>НоваяДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="23b56d4f-7c04-4bfd-9a20-3ea25aa83315">
      <name>НоваяДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0a8c9a08-a4ae-4fd5-8f1e-f1fb945a37f4">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40f5f639-3326-4442-93c7-db72bc8c2b5e">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1b6212e2-26ba-4550-804d-6c85664e4b5a">
    <name>ЗакрываемыеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b37a7dd6-3d54-4079-a8c7-1c03548f8537">
      <name>Заявка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1afb4107-068f-4994-98dd-e2872c1878ab">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешниеОснованияДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_СтатусыДокументовВнешнихОснованийУстановленные/торо_СтатусыДокументовВнешнихОснованийУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыДокументовВнешнихОснованийУстановленные</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1700dbd9-5fec-4508-82e9-7c68a672f6b8">
  <name>торо_ЗаявкиПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d7dfab1a-d04f-4eef-b624-41857ac954b6">
    <name>ДатаНачалаРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="56b7ecd8-6f82-48c0-a5e4-6b0ed35d9be8">
    <name>ДатаОкончанияРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c0f853e5-15d1-47ec-90ea-b70fc2292634">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="57cc77f3-0f99-4c18-8855-e9f9bb166844">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="63334144-1754-4ddf-bae4-01a96dcb2829">
    <name>УточнениеИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/ObjectModule.bsl
&Вместо("ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок")
Функция гкс_ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Организация КАК Организация,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_базы_расчета КАК ID_базы_расчета,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен КАК Замещен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_замещающего КАК ID_замещающего,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СтоимостьРемонта КАК СтоимостьРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&СписокID)
	|				И Регистратор <> &Ссылка) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен";
	
	Запрос.УстановитьПараметр("СписокID", ЗакрываемыеРемонты.ВыгрузитьКолонку("ID"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&После("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	// гкс+ [09.22] Деснол 12.09.2022
	// гкс+ [11.22] Деснол 17.11.2022
	МассивПеренесенных = Новый Массив();
	// гкс- [11.22] Деснол 17.11.2022
	МассивЗакрытых = Новый Массив();
	Для Каждого СтрокаТаблицы Из ЗакрываемыеРемонты Цикл
		Если СтрокаТаблицы.Отменен Тогда 
			МассивЗакрытых.Добавить(СтрокаТаблицы.ID);
			// гкс+ [11.22] Деснол 17.11.2022
		ИначеЕсли СтрокаТаблицы.Перенесен Тогда 
			МассивПеренесенных.Добавить(СтрокаТаблицы.ID);
			// гкс- [11.22] Деснол 17.11.2022
		КонецЕсли;
	КонецЦикла;
	Если МассивЗакрытых.Количество() Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "Выбрать Различные
		|	РегистрСведенийторо_ВнешниеОснованияДляРабот.ID КАК ИД,
		|	РегистрСведенийторо_ВнешниеОснованияДляРабот.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК РегистрСведенийторо_ВнешниеОснованияДляРабот
		|Где РегистрСведенийторо_ВнешниеОснованияДляРабот.ID В (&ИД)
		|	И РегистрСведенийторо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|";
		Запрос.УстановитьПараметр("ИД", МассивЗакрытых);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.торо_СтатусыДокументовВнешнихОснований.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор = Ссылка;
				НоваяЗапись.ИзменяемыйДокумент = Выборка.Ссылка;
				НоваяЗапись.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
				НоваяЗапись.СтатусУстановлен = Истина;
				НаборЗаписей.Записать();
				//
				НаборЗаписей = РегистрыСведений.торо_СтатусыДокументовВнешнихОснованийУстановленные.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор = Ссылка;
				НоваяЗапись.ИзменяемыйДокумент = Выборка.Ссылка;
				НоваяЗапись.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// гкс- [09.22] Деснол 12.09.2022
	// гкс+ [11.22] Деснол 17.11.2022
	Если МассивПеренесенных.Количество() Тогда
		СобытиеСсылка = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
		// найти заявки по ремонтам и сформировать уведомления
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта КАК ИД,
		               |	МАКСИМУМ(РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор) КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрСведенийторо_ЗаявкиПоРемонтам
		               |ГДЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта В(&ИД)
		               |	И РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта";
		Запрос.УстановитьПараметр("ИД", МассивПеренесенных);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСвойств = Новый Массив();
				НайдСтр = ЗакрываемыеРемонты.НайтиСтроки(Новый Структура("ID", Выборка.ИД));
				Если НайдСтр.Количество() > 0 Тогда 
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаНачала", НайдСтр[0].НоваяДатаНачала));
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаОкончания", НайдСтр[0].НоваяДатаОкончания));
				КонецЕсли;
				торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Выборка.Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
			КонецЦикла;
		КонецЕсли;
		//
		КонецЕсли;
	КонецЕсли;
	// гкс- [11.22] Деснол 17.11.2022
КонецПроцедуры

&После("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
